000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HOST.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 01 WS-ELEMENT-VARIABLE PIC X(128) VALUE 'testVar'.
001400 01 WS-ELEMENT-TYPE PIC X(128) VALUE 'button'.
001500 01 WS-PARENT PIC X(128) VALUE 'document.body'.
001600 01 WS-RETURN PIC S9.
001700 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001800 01 WS-HTML PIC X(256).
001900 01 WS-TMP PIC X(256).
002000 LINKAGE SECTION.
002100 PROCEDURE DIVISION.
002200 HOST-TEST SECTION.
002300 ENTRY 'HOST-TEST'.
002400   CALL 'COBDOM-VERSION' USING BY REFERENCE WS-VERSION.
002500   DISPLAY 'CobDOMinate version: ' WS-VERSION.
002600   CALL 'COBDOM-CREATE-ELEMENT' USING BY REFERENCE 
002700     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE.
002800   DISPLAY WS-RETURN.
002900   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
003000     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
003100   DISPLAY WS-RETURN.
003200   MOVE 'DNE' TO WS-PARENT.
003300   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
003400     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
003500   DISPLAY WS-RETURN.
003600   MOVE 'PRESS ME' TO WS-TMP.
003700   STRING
003800     WS-TMP DELIMITED BY SPACE
003900     WS-NULL-BYTE DELIMITED BY SIZE
004000   INTO WS-HTML END-STRING.
004100   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
004200     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
004300   DISPLAY WS-RETURN.
004400   GOBACK.
