000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HOST.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 01 WS-ELEMENT-VARIABLE PIC X(128) VALUE 'testVar'.
001400 01 WS-ELEMENT-TYPE PIC X(128) VALUE 'button'.
001500 01 WS-PARENT PIC X(128) VALUE 'document.body'.
001600 01 WS-RETURN PIC S9.
001700 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001800 01 WS-HTML PIC X(256).
001900 01 WS-FUNCTION PIC X(64).
002000 01 WS-TMP PIC X(256).
002100 LINKAGE SECTION.
002200 PROCEDURE DIVISION.
002300 HOST_TEST SECTION.
002400*Note: For some reason HOST-TEST did not work perhaps because of a
002500*recognized word.
002600 ENTRY 'HOST_TEST'.
002700   CALL 'COBDOM-INIT' USING BY REFERENCE WS-RETURN.
002800   DISPLAY WS-RETURN.
002900   CALL 'COBDOM-VERSION' USING BY REFERENCE WS-VERSION.
003000   DISPLAY 'CobDOMinate version: ' WS-VERSION.
003100   CALL 'COBDOM-CREATE-ELEMENT' USING BY REFERENCE 
003200     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE.
003300   DISPLAY WS-RETURN.
003400   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
003500     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
003600   DISPLAY WS-RETURN.
003700   MOVE 'DNE' TO WS-PARENT.
003800   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
003900     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
004000   DISPLAY 'Should Error: ' WS-RETURN.
004100   MOVE 'PRESS ME' TO WS-TMP.
004200   STRING
004300     WS-TMP DELIMITED BY SPACE
004400     WS-NULL-BYTE DELIMITED BY SIZE
004500   INTO WS-HTML END-STRING.
004600   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
004700     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
004800   DISPLAY WS-RETURN.
004900   MOVE '() => { Module.ccall("TESTFUNC", null, [], []); })'
005000     TO WS-TMP.
005100   STRING
005200     WS-TMP(1:50) DELIMITED BY SIZE
005300     WS-NULL-BYTE DELIMITED BY SIZE
005400   INTO WS-FUNCTION END-STRING.
005500   MOVE 'click' TO WS-ELEMENT-TYPE.
005600   CALL 'COBDOM-ADD-EVENT-LISTENER' USING BY REFERENCE
005700     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE
005800     WS-FUNCTION.
005900   DISPLAY WS-RETURN.
006000   GOBACK.
006100 TESTFUNC SECTION.
006200 ENTRY 'TESTFUNC'.
006300   DISPLAY 'TESTFUNC Called!'.
006400   GOBACK.
