000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HOST.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 01 WS-ELEMENT-VARIABLE PIC X(128) VALUE 'testVar'.
001400 01 WS-ELEMENT-TYPE PIC X(128) VALUE 'button'.
001500 01 WS-PARENT PIC X(128) VALUE 'document.body'.
001600 01 WS-RETURN PIC S9.
001700 LINKAGE SECTION.
001800 PROCEDURE DIVISION.
001900 HOST-TEST SECTION.
002000 ENTRY 'HOST-TEST'.
002100   CALL 'COBDOM-VERSION' USING BY REFERENCE WS-VERSION.
002200   DISPLAY 'CobDOMinate version: ' WS-VERSION.
002300   CALL 'COBDOM-CREATE-ELEMENT' USING BY REFERENCE 
002400     WS-ELEMENT-VARIABLE, WS-RETURN, WS-ELEMENT-TYPE.
002500   DISPLAY WS-RETURN.
002600   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
002700     WS-ELEMENT-VARIABLE, WS-RETURN, WS-PARENT.
002800   DISPLAY WS-RETURN.
002900   MOVE 'DNE' TO WS-PARENT.
003000   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
003100     WS-ELEMENT-VARIABLE, WS-RETURN, WS-PARENT.
003200   DISPLAY WS-RETURN.
003300   GOBACK.
