000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MAIN.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 LINKAGE SECTION.
001400 PROCEDURE DIVISION.
001500 CALL "COBDOM-VERSION" USING WS-VERSION.
001600 DISPLAY WS-VERSION.
