000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLESITE.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-RETURN PIC S9.
001300 01 WS-NORM PIC X(256).
001400 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001500 LINKAGE SECTION.
001600 PROCEDURE DIVISION.
001700 EXAMPLE SECTION.
001800 ENTRY 'EXAMPLE'.
001900   MOVE 'This is my test string' TO WS-NORM.
002100   CALL 'cobdom_test_string' USING BY REFERENCE WS-NORM
002100     RETURNING WS-RETURN.
002200   GOBACK.
