000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLESITE.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-COOKIE.
001300   05 ALLOWED PIC X(64).
001400   05 NAME PIC X(14) VALUE 'cookiesAllowed'.
001500 01 WS-RETURN PIC S9.
001600 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001700 01 WS-DOCBOD PIC X(4) VALUE 'body'.
001800 01 WS-ELEMENTS.
001900   05 BUTTON-1.
002000     10 VAR PIC X(7) VALUE 'button1'.
002100     10 TYP PIC X(6) VALUE 'button'.
002200 01 EVT-TYP PIC X(5) VALUE 'click'.
002300 01 FUNC PIC X(8) VALUE 'CALLBACK'.
002400 LINKAGE SECTION.
002500 PROCEDURE DIVISION.
002600 EXAMPLE SECTION.
002700 ENTRY 'EXAMPLE'.
002800   CALL 'CHECK-COOKIE'.
002900   CALL 'cobdom_create_element' USING BY REFERENCE 
003000     VAR OF BUTTON-1, TYP OF BUTTON-1 RETURNING WS-RETURN.
003100   DISPLAY 'Create element: ' WS-RETURN.
003200   CALL 'cobdom_inner_html' USING BY REFERENCE VAR OF BUTTON-1,
003300     TYP OF BUTTON-1 RETURNING WS-RETURN.
003400   DISPLAY 'Inner HTML: ' WS-RETURN.
003500   CALL 'cobdom_append_child' USING BY REFERENCE
003600     VAR OF BUTTON-1, WS-DOCBOD RETURNING WS-RETURN.
003700   DISPLAY 'Append child: ' WS-RETURN.
003800   CALL 'cobdom_add_event_listener' USING BY REFERENCE
003900     VAR OF BUTTON-1, EVT-TYP,
004000     FUNC RETURNING WS-RETURN.
004100   DISPLAY 'Add event listener: ' WS-RETURN.
004200   GOBACK. 
004300 CALLBACK SECTION.
004400 ENTRY 'CALLBACK'.
004500   CALL 'cobdom_remove_child' USING BY REFERENCE
004600     VAR OF BUTTON-1, WS-DOCBOD RETURNING WS-RETURN.
004700   DISPLAY 'Callback!'.
004800   GOBACK.
004900 CHECK-COOKIE SECTION.
005000 ENTRY 'CHECK-COOKIE'.
005100   CALL 'cobdom_get_cookie' USING BY REFERENCE ALLOWED,
005200     NAME RETURNING WS-RETURN.
005300   DISPLAY 'Checking cookie...'.
005400   IF WS-RETURN >= 0
005500     IF ALLOWED NOT = SPACES
005600       DISPLAY ALLOWED
005700     ELSE
005800       DISPLAY 'Cookie not set.'
005900     END-IF
006000   ELSE
006100     DISPLAY 'Error.'
006200   END-IF.
006300   GOBACK.
