000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EXAMPLESITE.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-CLASS-BUTTON PIC X(11) VALUE 'buttonClass'.
001300 01 WS-SPAN PIC X(4) VALUE 'span'.
001400 01 WS-DIV PIC X(3) VALUE 'div'.
001500 01 WS-CLICK PIC X(5) VALUE 'click'.
001600 01 WS-TAB-1.
001700   05 VAR PIC X(4) VALUE 'tab1'.
001800   05 NB PIC X VALUE X"00".
001900*Note when using grouping that will be passed to cobdom we must
002000*put null bytes between sections as COBOL stores this data
002100*contiguous in memory.
002200   05 LAB PIC X(5) VALUE 'Tab 1'.
002300   05 NB PIC X VALUE X"00".
002400   05 FUNC PIC X(4) VALUE 'TAB1'.
002500   05 NB PIC X VALUE X"00".
002600   05 CONT PIC X(256).
002700   05 NB PIC X VALUE X"00".
002800 01 WS-TAB-2.
002900   05 VAR PIC X(4) VALUE 'tab2'.
003000   05 NB PIC X VALUE X"00".
003100   05 LAB PIC X(5) VALUE 'Tab 2'.
003200   05 NB PIC X VALUE X"00".
003300   05 FUNC PIC X(4) VALUE 'TAB2'.
003400   05 NB PIC X VALUE X"00".
003500   05 CONT PIC X(256).
003600   05 NB PIC X VALUE X"00".
003700 01 WS-TAB-3.
003800   05 VAR PIC X(4) VALUE 'tab3'.
003900   05 NB PIC X VALUE X"00".
004000   05 LAB PIC X(5) VALUE 'Tab 3'.
004100   05 NB PIC X VALUE X"00".
004200   05 FUNC PIC X(4) VALUE 'TAB3'.
004300   05 NB PIC X VALUE X"00".
004400   05 CONT PIC X(256).
004500   05 NB PIC X VALUE X"00".
004600 01 WS-TAB-DIV.
004700   05 VAR PIC X(6) VALUE 'tabDiv'.
004800   05 NB PIC X VALUE X"00".
004900 01 WS-CONTENT-DIV.
005000   05 VAR PIC X(10) VALUE 'contentDiv'.
005100   05 NB PIC X VALUE X"00".
005200 01 WS-DOCBOD PIC X(4) VALUE 'body'.
005300 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
005400 01 WS-RETURN PIC S9.
005500*01 WS-BLOB PIC X(10000).
005600 01 WS-SRC PIC X(10000).
005700 LINKAGE SECTION.
005800 01 LS-BLOB PIC X(10000).
005900 01 LS-BLOB-SIZE PIC 9(10).
006000 PROCEDURE DIVISION.
006100 EXAMPLE SECTION.
006200 ENTRY 'EXAMPLE'.
006300   CALL 'LAYOUT'.
006400   CALL 'cobdom_fetch' USING 'FETCHCALLBACK',
006500     '/example/example.cob', 'GET', '' RETURNING WS-RETURN.
006600   GOBACK.
006700 FETCHCALLBACK SECTION.
006800*Note functions must not contain dashes in the name (-)
006900 ENTRY 'FETCHCALLBACK' USING BY REFERENCE LS-BLOB-SIZE,LS-BLOB.
007000*  DISPLAY LS-BLOB-SIZE.
007100   DISPLAY LS-BLOB(1:LS-BLOB-SIZE).
007200   MOVE LS-BLOB(1:LS-BLOB-SIZE) TO WS-SRC.
007300   GOBACK.
007400 LAYOUT SECTION.
007500 ENTRY 'LAYOUT'.
007600   CALL 'cobdom_create_element' USING BY REFERENCE
007700     VAR OF WS-TAB-1, WS-SPAN RETURNING WS-RETURN.
007800   CALL 'cobdom_set_class' USING BY REFERENCE
007900     VAR OF WS-TAB-1, WS-CLASS-BUTTON RETURNING WS-RETURN.
008000   CALL 'cobdom_inner_html' USING BY REFERENCE
008100     VAR OF WS-TAB-1, LAB OF WS-TAB-1 RETURNING WS-RETURN.
008200   CALL 'cobdom_create_element' USING BY REFERENCE
008300     VAR OF WS-TAB-2, WS-SPAN RETURNING WS-RETURN.
008400   CALL 'cobdom_set_class' USING BY REFERENCE
008500     VAR OF WS-TAB-2, WS-CLASS-BUTTON RETURNING WS-RETURN.
008600   CALL 'cobdom_inner_html' USING BY REFERENCE
008700     VAR OF WS-TAB-2,LAB OF WS-TAB-2 RETURNING WS-RETURN.
008800   CALL 'cobdom_create_element' USING BY REFERENCE
008900     VAR OF WS-TAB-3, WS-SPAN RETURNING WS-RETURN.
009000   CALL 'cobdom_set_class' USING BY REFERENCE
009100     VAR OF WS-TAB-3, WS-CLASS-BUTTON RETURNING WS-RETURN.
009200   CALL 'cobdom_inner_html' USING BY REFERENCE
009300     VAR OF WS-TAB-3, LAB OF WS-TAB-3 RETURNING WS-RETURN.
009400   CALL 'cobdom_create_element' USING BY REFERENCE
009500     VAR OF WS-TAB-DIV, WS-DIV RETURNING WS-RETURN.
009600   CALL 'cobdom_append_child' USING BY REFERENCE VAR OF WS-TAB-1,
009700     VAR OF WS-TAB-DIV RETURNING WS-RETURN.
009800   CALL 'cobdom_append_child' USING BY REFERENCE VAR OF WS-TAB-2,
009900     VAR OF WS-TAB-DIV RETURNING WS-RETURN.
010000   CALL 'cobdom_append_child' USING BY REFERENCE VAR OF WS-TAB-3,
010100     VAR OF WS-TAB-DIV RETURNING WS-RETURN.
010200   CALL 'cobdom_append_child' USING BY REFERENCE 
010300     VAR OF WS-TAB-DIV, WS-DOCBOD RETURNING WS-RETURN.
010400   CALL 'cobdom_add_event_listener' USING BY REFERENCE
010500     VAR OF WS-TAB-1, WS-CLICK, FUNC OF WS-TAB-1
010600     RETURNING WS-RETURN.
010700   CALL 'cobdom_add_event_listener' USING BY REFERENCE
010800     VAR OF WS-TAB-2, WS-CLICK, FUNC OF WS-TAB-2
010900     RETURNING WS-RETURN.
011000   CALL 'cobdom_add_event_listener' USING BY REFERENCE
011100     VAR OF WS-TAB-3, WS-CLICK, FUNC OF WS-TAB-3
011200     RETURNING WS-RETURN.
011300   CALL 'cobdom_class_style' USING BY REFERENCE
011400     WS-CLASS-BUTTON, 'display', 'inline-block' 
011500     RETURNING WS-RETURN.
011600   CALL 'cobdom_class_style' USING BY REFERENCE
011700     WS-CLASS-BUTTON, 'padding', '2rem' 
011800     RETURNING WS-RETURN.
011900   CALL 'cobdom_class_style' USING BY REFERENCE
012000     WS-CLASS-BUTTON, 'backgroundColor', '#006600' 
012100     RETURNING WS-RETURN.
012200   CALL 'cobdom_create_element' USING BY REFERENCE 
012300     VAR OF WS-CONTENT-DIV, WS-DIV RETURNING WS-RETURN.
012400   CALL 'cobdom_style' USING BY REFERENCE
012500     VAR OF WS-CONTENT-DIV, 'backgroundColor', '#00ff00' 
012600     RETURNING WS-RETURN.
012700   CALL 'cobdom_append_child' USING BY REFERENCE
012800     VAR OF WS-CONTENT-DIV, WS-DOCBOD RETURNING WS-RETURN.
012900   MOVE 'Welcome to tab 1!' TO CONT OF WS-TAB-1.
013000   MOVE 'Welcome to tab 2!' TO CONT OF WS-TAB-2.
013100   MOVE 'Welcome to tab 3!' TO CONT OF WS-TAB-3.
013200   CALL 'cobdom_inner_html' USING BY REFERENCE
013300     VAR OF WS-CONTENT-DIV, CONT OF WS-TAB-1 RETURNING WS-RETURN.
013400   CALL 'cobdom_style' USING BY REFERENCE
013500     VAR OF WS-TAB-1, 'backgroundColor', '#00ff00' 
013600     RETURNING WS-RETURN.
013700   GOBACK. 
013800 TAB1 SECTION.
013900 ENTRY 'TAB1'.
014000   CALL 'cobdom_class_style' USING BY REFERENCE
014100     WS-CLASS-BUTTON, 'backgroundColor', '#006600' 
014200     RETURNING WS-RETURN.
014300   CALL 'cobdom_style' USING BY REFERENCE
014400     VAR OF WS-TAB-1, 'backgroundColor', '#00ff00' 
014500     RETURNING WS-RETURN.
014600   CALL 'cobdom_inner_html' USING BY REFERENCE
014700     VAR OF WS-CONTENT-DIV, CONT OF WS-TAB-1 RETURNING WS-RETURN.
014800   GOBACK.
014900 TAB2 SECTION.
015000 ENTRY 'TAB2'.
015100   CALL 'cobdom_class_style' USING BY REFERENCE
015200     WS-CLASS-BUTTON, 'backgroundColor', '#006600' 
015300     RETURNING WS-RETURN.
015400   CALL 'cobdom_style' USING BY REFERENCE
015500     VAR OF WS-TAB-2, 'backgroundColor', '#00ff00' 
015600     RETURNING WS-RETURN.
015700   CALL 'cobdom_inner_html' USING BY REFERENCE
015800     VAR OF WS-CONTENT-DIV, CONT OF WS-TAB-2 RETURNING WS-RETURN.
015900   GOBACK.
016000 TAB3 SECTION.
016100 ENTRY 'TAB3'.
016200   CALL 'cobdom_class_style' USING BY REFERENCE
016300     WS-CLASS-BUTTON, 'backgroundColor', '#006600' 
016400     RETURNING WS-RETURN.
016500   CALL 'cobdom_style' USING BY REFERENCE
016600     VAR OF WS-TAB-3, 'backgroundColor', '#00ff00' 
016700     RETURNING WS-RETURN.
016800   CALL 'cobdom_inner_html' USING BY REFERENCE
016900     VAR OF WS-CONTENT-DIV, CONT OF WS-TAB-3 RETURNING WS-RETURN.
017000   GOBACK.
