000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HOST.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 01 WS-ELEMENT-VARIABLE PIC X(128) VALUE 'myElement'.
001400 01 WS-ELEMENT-TYPE PIC X(128) VALUE 'button'.
001500 01 WS-PARENT PIC X(128) VALUE 'document.body'.
001600 01 WS-RETURN PIC S9.
001700 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001800 01 WS-HTML PIC X(256).
001900 01 WS-FUNCTION PIC X(64).
002000 01 WS-CLASS-NAME PIC X(64).
002100 01 WS-TMP PIC X(256).
002200 01 WS-COUNT PIC 99 VALUE 0.
002300 LINKAGE SECTION.
002400 PROCEDURE DIVISION.
002500 EXAMPLE SECTION.
002600*Note: For some reason HOST-TEST did not work perhaps because of a
002700*recognized word.
002800 ENTRY 'EXAMPLE'.
002900   CALL 'COBDOM-VERSION' USING BY REFERENCE WS-VERSION.
003000   DISPLAY 'CobDOMinate version: ' WS-VERSION.
003100   CALL 'COBDOM-CREATE-ELEMENT' USING BY REFERENCE 
003200     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE.
003300   DISPLAY WS-RETURN.
003400   MOVE 'myClass' TO WS-CLASS-NAME.
003500   DISPLAY WS-CLASS-NAME.
003600   CALL 'COBDOM-CLASS-NAME' USING BY REFERENCE
003700     WS-RETURN, WS-ELEMENT-VARIABLE, WS-CLASS-NAME.
003800   DISPLAY WS-RETURN. 
003900   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
004000     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
004100   DISPLAY WS-RETURN.
004200   MOVE 'DNE' TO WS-PARENT.
004300   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
004400     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
004500   DISPLAY 'Should Error: ' WS-RETURN.
004600   MOVE 'PRESS ME' TO WS-TMP.
004700   STRING
004800     WS-TMP(1:10) DELIMITED BY SIZE
004900     WS-COUNT DELIMITED BY SIZE
005000     WS-NULL-BYTE DELIMITED BY SIZE
005100   INTO WS-HTML END-STRING.
005200   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
005300     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
005400   DISPLAY WS-RETURN.
005500   MOVE '() => { Module.ccall("TESTFUNC", null, [], []); })'
005600     TO WS-TMP.
005700   STRING
005800     WS-TMP(1:50) DELIMITED BY SIZE
005900     WS-NULL-BYTE DELIMITED BY SIZE
006000   INTO WS-FUNCTION END-STRING.
006100   MOVE 'click' TO WS-ELEMENT-TYPE.
006200   CALL 'COBDOM-ADD-EVENT-LISTENER' USING BY REFERENCE
006300     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE
006400     WS-FUNCTION.
006500   DISPLAY WS-RETURN.
006600   GOBACK.
006700 TESTFUNC SECTION.
006800 ENTRY 'TESTFUNC'.
006900   ADD 1 TO WS-COUNT.
007000   MOVE 'PRESS ME' TO WS-TMP.
007100   STRING
007200     WS-TMP(1:10) DELIMITED BY SIZE
007300     WS-COUNT DELIMITED BY SIZE
007400     WS-NULL-BYTE DELIMITED BY SIZE
007500   INTO WS-HTML END-STRING.
007600   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
007700     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
007800   DISPLAY WS-RETURN.
007900   GOBACK.
