000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HOST.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 01 WS-VERSION PIC 99V99.
001300 01 WS-ELEMENT-VARIABLE PIC X(128) VALUE 'myElement'.
001400 01 WS-ELEMENT-TYPE PIC X(128) VALUE 'button'.
001500 01 WS-PARENT PIC X(128) VALUE 'document.body'.
001600 01 WS-RETURN PIC S9.
001700 01 WS-NULL-BYTE PIC X(1) VALUE X'00'.
001800 01 WS-HTML PIC X(256).
001900 01 WS-FUNCTION PIC X(64).
002000 01 WS-CLASS-NAME PIC X(64).
002100 01 WS-TMP PIC X(256).
002200 01 WS-COUNT PIC 99 VALUE 0.
002300 01 WS-GENERIC PIC X(256).
002400 01 WS-COOKIE-NAME PIC X(32) VALUE 'mycookie'.
002500 LINKAGE SECTION.
002600 PROCEDURE DIVISION.
002700 EXAMPLE SECTION.
002800*Note: For some reason HOST-TEST did not work perhaps because of a
002900*recognized word.
003000 ENTRY 'EXAMPLE'.
003100   CALL 'COBDOM-VERSION' USING BY REFERENCE WS-VERSION.
003200   DISPLAY 'CobDOMinate version: ' WS-VERSION.
003300   CALL 'COBDOM-CREATE-ELEMENT' USING BY REFERENCE 
003400     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE.
003500   DISPLAY WS-RETURN.
003600   MOVE 'myClass' TO WS-CLASS-NAME.
003700   DISPLAY WS-CLASS-NAME.
003800   CALL 'COBDOM-CLASS-NAME' USING BY REFERENCE
003900     WS-RETURN, WS-ELEMENT-VARIABLE, WS-CLASS-NAME.
004000   DISPLAY WS-RETURN. 
004100   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
004200     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
004300   DISPLAY WS-RETURN.
004400   MOVE 'DNE' TO WS-PARENT.
004500   CALL 'COBDOM-APPEND-CHILD' USING BY REFERENCE
004600     WS-RETURN, WS-ELEMENT-VARIABLE, WS-PARENT.
004700   DISPLAY 'Should Error: ' WS-RETURN.
004800   MOVE 'PRESS ME' TO WS-TMP.
004900   STRING
005000     WS-TMP(1:10) DELIMITED BY SIZE
005100     WS-COUNT DELIMITED BY SIZE
005200     WS-NULL-BYTE DELIMITED BY SIZE
005300   INTO WS-HTML END-STRING.
005400   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
005500     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
005600   DISPLAY WS-RETURN.
005700   MOVE '() => { Module.ccall("TESTFUNC", null, [], []); })'
005800     TO WS-TMP.
005900   STRING
006000     WS-TMP(1:50) DELIMITED BY SIZE
006100     WS-NULL-BYTE DELIMITED BY SIZE
006200   INTO WS-FUNCTION END-STRING.
006300   MOVE 'click' TO WS-ELEMENT-TYPE.
006400   CALL 'COBDOM-ADD-EVENT-LISTENER' USING BY REFERENCE
006500     WS-RETURN, WS-ELEMENT-VARIABLE, WS-ELEMENT-TYPE
006600     WS-FUNCTION.
006700   DISPLAY WS-RETURN.
006800   GOBACK.
006900 TESTFUNC SECTION.
007000 ENTRY 'TESTFUNC'.
007100   ADD 1 TO WS-COUNT.
007200   MOVE 'PRESS ME' TO WS-TMP.
007300   STRING
007400     WS-TMP(1:10) DELIMITED BY SIZE
007500     WS-COUNT DELIMITED BY SIZE
007600     WS-NULL-BYTE DELIMITED BY SIZE
007700   INTO WS-HTML END-STRING.
007800   CALL 'COBDOM-INNER-HTML' USING BY REFERENCE
007900     WS-RETURN, WS-ELEMENT-VARIABLE, WS-HTML.
008000   DISPLAY WS-RETURN.
008100   MOVE 'backgroundColor="#00ff00"'
008200     TO WS-TMP.
008300   STRING
008400     WS-TMP(1:25) DELIMITED BY SIZE
008500     WS-NULL-BYTE DELIMITED BY SIZE
008600   INTO WS-GENERIC END-STRING.
008700   CALL 'COBDOM-STYLE' USING BY REFERENCE WS-RETURN,
008800     WS-ELEMENT-VARIABLE, WS-GENERIC.
008900   DISPLAY WS-RETURN.
009000   MOVE 'My Data'
009100     TO WS-TMP.
009200   STRING
009300     WS-TMP(1:7) DELIMITED BY SIZE
009400     WS-NULL-BYTE DELIMITED BY SIZE
009500   INTO WS-GENERIC END-STRING.
009600   CALL 'COBDOM-SET-COOKIE' USING BY REFERENCE WS-RETURN,
009700     WS-COOKIE-NAME, WS-GENERIC.
009800   DISPLAY WS-RETURN.
010000   GOBACK.
