000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBDOM.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 COPY './data/jscode.cpy'.
001300 LINKAGE SECTION.
001400 01 LS-VERSION PIC 99V99.
001500 PROCEDURE DIVISION.
001600 COBDOM-VERSION SECTION.
001700 ENTRY 'COBDOM-VERSION' USING LS-VERSION.
001800   MOVE .01 TO LS-VERSION.
001900   DISPLAY WS-JSCODE.
002000   GOBACK.
