000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBDOM.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 COPY './data/js.cpy'.
001300 LINKAGE SECTION.
001400 01 LS-VERSION PIC 99V99.
001500 01 LS-ELEMENT-VARIABLE PIC X(128).
001600 01 LS-ELEMENT-TYPE PIC X(128).
001700 01 LS-PARENT PIC X(128).
001800 01 LS-RETURN PIC S9.
001900 01 LS-HTML PIC X(256).
002000 01 LS-FUNCTION PIC X(64).
002100 PROCEDURE DIVISION.
002200 COBDOM-INIT SECTION.
002300 ENTRY 'COBDOM-INIT' USING LS-RETURN.
002500   DISPLAY WS-COB-INIT.
002500   CALL 'emscripten_run_script_int' USING BY REFERENCE 
002600   WS-COB-INIT RETURNING LS-RETURN.
002700 COBDOM-VERSION SECTION.
002800 ENTRY 'COBDOM-VERSION' USING BY REFERENCE LS-VERSION.
002900*I think by reference is redundant here.
003000   MOVE .01 TO LS-VERSION.
003100*  CALL 'emscripten_run_script_int' USING BY CONTENT WS-JS-TEST.
003200*  MOVE FUNCTION TRIM('div', TRAILING) TO WS-ELEMENT-TYPE.
003300*  DISPLAY WS-ELEMENT-TYPE '.'.
003400   GOBACK.
003500 COBDOM-CREATE-ELEMENT SECTION.
003600 ENTRY 'COBDOM-CREATE-ELEMENT' USING BY 
003700   REFERENCE LS-RETURN, LS-ELEMENT-VARIABLE,
003800   LS-ELEMENT-TYPE.
003900   STRING 
004000     PART-A OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
004100     LS-ELEMENT-VARIABLE
004200     PART-A OF CREATE-ELEMENT OF WS-JS-COMMANDS
004300     LS-ELEMENT-TYPE
004400     PART-B OF CREATE-ELEMENT OF WS-JS-COMMANDS DELIMITED BY SPACE
004500     PART-B OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
004600     WS-NULL-BYTE DELIMITED BY SIZE
004700*The null byte is needed because were passing C strings to
004800*emscripten's API.
004900   INTO WS-JS-COMMAND END-STRING.
005000   CALL 'emscripten_run_script_int' USING BY REFERENCE
005100     WS-JS-COMMAND RETURNING LS-RETURN.
005200   GOBACK.
005300 COBDOM-APPEND-CHILD SECTION.
005400 ENTRY 'COBDOM-APPEND-CHILD' USING BY REFERENCE
005500   LS-RETURN, LS-ELEMENT-VARIABLE, LS-PARENT.
005600   STRING
005700     PART-A OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
005800     LS-PARENT
005900     PART-A OF APPEND-CHILD OF WS-JS-COMMANDS
006000     LS-ELEMENT-VARIABLE DELIMITED BY SPACE
006100     WS-END-PARENTHESIS DELIMITED BY SIZE
006200     PART-B OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
006300     WS-NULL-BYTE DELIMITED BY SIZE
006400   INTO WS-JS-COMMAND END-STRING.
006500   CALL 'emscripten_run_script_int' USING BY REFERENCE
006600     WS-JS-COMMAND RETURNING LS-RETURN.
006700   GOBACK.
006800 COBDOM-REMOVE-CHILD SECTION.
006900 ENTRY 'COBDOM-REMOVE-CHILD' USING BY REFERENCE
007000   LS-ELEMENT-VARIABLE, LS-RETURN, LS-PARENT.
007100   STRING
007200     PART-A OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
007300     LS-PARENT
007400     PART-A OF REMOVE-CHILD OF WS-JS-COMMANDS
007500     LS-ELEMENT-VARIABLE DELIMITED BY SPACE
007600     WS-END-PARENTHESIS DELIMITED BY SIZE
007700     PART-B OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
007800     WS-NULL-BYTE DELIMITED BY SIZE
007900   INTO WS-JS-COMMAND END-STRING.
008000   CALL 'emscripten_run_script_int' USING BY REFERENCE 
008100     WS-JS-COMMAND RETURNING LS-RETURN.
008200   GOBACK.
008300*Correct all of the above function delimiters.
008400 COBDOM-INNER-HTML SECTION.
008500 ENTRY 'COBDOM-INNER-HTML' USING BY REFERENCE
008600   LS-RETURN, LS-ELEMENT-VARIABLE, LS-HTML.
008700   STRING
008800     PART-A OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
008900     LS-ELEMENT-VARIABLE DELIMITED BY SPACE
009000     PART-A OF INNER-HTML OF WS-JS-COMMANDS DELIMITED BY SIZE
009100     LS-HTML DELIMITED BY WS-NULL-BYTE
009200     WS-END-DOUBLE-QUOTE DELIMITED BY SIZE
009300     PART-B OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
009400     WS-NULL-BYTE DELIMITED BY SIZE
009500   INTO WS-JS-COMMAND END-STRING.
009600   CALL 'emscripten_run_script_int' USING BY REFERENCE 
009700     WS-JS-COMMAND RETURNING LS-RETURN.
009800   GOBACK.
009900 COBDOM-ADD-EVENT-LISTENER SECTION.
010000 ENTRY 'COBDOM-ADD-EVENT-LISTENER' USING BY REFERENCE
010100   LS-RETURN, LS-ELEMENT-VARIABLE, LS-ELEMENT-TYPE, 
010200   LS-FUNCTION.
010300*  DISPLAY LS-FUNCTION.
010400   STRING
010500     PART-A OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
010600     LS-ELEMENT-VARIABLE DELIMITED BY SPACE
010700     PART-A OF ADD-EVENT-LISTENER OF WS-JS-COMMANDS 
010800     DELIMITED BY SIZE
010900     LS-ELEMENT-TYPE DELIMITED BY SPACE
011000     PART-B OF ADD-EVENT-LISTENER OF WS-JS-COMMANDS 
011100     DELIMITED BY SIZE
011200     LS-FUNCTION DELIMITED BY WS-NULL-BYTE
011300*     WS-END-PARENTHESIS DELIMITED BY SIZE
011400     PART-B OF STATUS-WRAPPER OF WS-JS-COMMANDS DELIMITED BY SIZE
011500     WS-NULL-BYTE DELIMITED BY SIZE
011600   INTO WS-JS-COMMAND END-STRING.
011700*  DISPLAY WS-JS-COMMAND.
011800   CALL 'emscripten_run_script_int' USING BY REFERENCE 
011900     WS-JS-COMMAND RETURNING LS-RETURN.
012000   GOBACK.
012100*TO-DO put returns in these functions to verify success! This
012200*This will have to be done by wrapping scripts into a function
012300*with a try catch statement or something of the sort.
012400*COBDOM-INNER-HTML SECTION.
012500*ENTRY 'COBDOM-INNER-HTML' USING
012600*So here this gets crazy, since we are using eval, we can return
012700*the variable name, or we could store the objects in a structure
012800*and return its key/index, or we could create and add it relying
012900*only on the id.
