000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. COBDOM.
000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
000500 SOURCE-COMPUTER. UNIX-LINUX.
000600 OBJECT-COMPUTER. WASM.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
001200 LINKAGE SECTION.
001300 01 LS-VERSION PIC 99V99.
001400 PROCEDURE DIVISION.
001500 COBDOM-VERSION SECTION.
001600 ENTRY "COBDOM-VERSION" USING LS-VERSION.
001700   MOVE .01 TO LS-VERSION.
001800   GOBACK.
