000100 01 WS-JS-TEST PIC X(36) VALUE 'console.log("Hello from Javascript
000200-'")'.
000300*Look into UNSTRING as far as getting pic values to be the proper
000400*length as errors will occur otherwise unless some wrapper or
000400*something trims after.
